Repository: HollowMan6/IBus-Theme
Catalog: ibus_theme_tools/locale/*/LC_MESSAGES/IBus-Theme.po
Languages: ta

source: Please enter your image file path (empty to exit file selection):
ta: தயவுசெய்து உங்கள் பட கோப்பு பாதையை உள்ளிடவும் (கோப்பு தேர்விலிருந்து வெளியேற காலியாக):

source: Please select a image file:
ta: படக் கோப்பைத் தேர்ந்தெடுக்கவும்:

source: Re-Enter Path
ta: பாதையில் மீண்டும் உள்ளிடவும்

source: (Empty to Re-Enter Path):
ta: (பாதையில் மீண்டும் நுழைய காலியாக):

source: Error: Not an Image File!
ta: பிழை: படக் கோப்பு அல்ல!

source: Error: Wrong selection!
ta: பிழை: தவறான தேர்வு!

source: /* Customized Background Image */
ta: / * தனிப்பயனாக்கப்பட்ட பின்னணி படம் */

source: Please select repeat mode for your image:
ta: உங்கள் படத்திற்கான மீண்டும் பயன்முறையைத் தேர்ந்தெடுக்கவும்:

source: No
ta: இல்லை

source: Yes
ta: ஆம்

source: (Empty to be 1):
ta: (1 ஆக காலியாக உள்ளது):

source: Please select sizing mode for your image:
ta: உங்கள் படத்திற்கான அளவு பயன்முறையைத் தேர்ந்தெடுக்கவும்:

source: Stretched
ta: நீட்டப்பட்டது

source: Please input the image border radius you want to set in px(Empty to not set):
ta: நீங்கள் PX இல் அமைக்க விரும்பும் பட எல்லை ஆரம் உள்ளிடவும் (அமைக்காமல் இருக்க காலியாக):

source: Error: Please Enter a Number!
ta: பிழை: தயவுசெய்து ஒரு எண்ணை உள்ளிடவும்!

source: Error: Path Not Exists!
ta: பிழை: பாதை இல்லை!

source: Please select a GTK theme to extract for IBus:
ta: IBUS க்கு பிரித்தெடுக்க ஒரு GTK கருப்பொருள் என்பதைத் தேர்ந்தெடுக்கவும்:

source: Exit
ta: வெளியேறு

source: (Empty to exit):
ta: (வெளியேற வெற்று):

source: Goodbye!
ta: குட்பை!

source: Please select a GTK theme for other styles:
ta: பிற பாணிகளுக்கு சி.டி.கே கருப்பொருளைத் தேர்ந்தெடுக்கவும்:

source: (Empty to not select):
ta: (தேர்ந்தெடுக்காமல் இருக்க காலியாக):

source: Do you need a customized background image for IBus panel?
ta: IBUS பேனலுக்கு தனிப்பயனாக்கப்பட்ட பின்னணி படம் உங்களுக்குத் தேவையா?

source: Now you can select:
ta: இப்போது நீங்கள் தேர்ந்தெடுக்கலாம்:

source: in your desktop GTK theme settings to use the configuration above.
ta: மேலே உள்ளமைவைப் பயன்படுத்த உங்கள் டெச்க்டாப் சி.டி.கே கருப்பொருள் அமைப்புகளில்.

source: Done! Goodbye!
ta: முடிந்தது! குட்பை!

source: /* Generated by IBus Theme Tools
ta: /* IBUS கருப்பொருள் கருவிகளால் உருவாக்கப்பட்டது

source: Tool Author:
ta: கருவி ஆசிரியர்:

source: Tool Source Code:
ta: கருவி மூலக் குறியீடு:

source: Tool Licence:
ta: கருவி உரிமம்:

source: CSS Source File:
ta: சிஎச்எச் மூல கோப்பு:

source: /* Imported from CSS Source File:
ta: /* சிஎச்எச் மூல கோப்பிலிருந்து இறக்குமதி செய்யப்பட்டது:

source: Recommend to use Customize IBus GNOME Shell Extension:
ta: தனிப்பயனாக்கு IBUS GNOME ஓடு நீட்டிப்பை பயன்படுத்த பரிந்துரைக்கவும்:

source: to change IBus theme by selecting this file.
ta: இந்த கோப்பைத் தேர்ந்தெடுப்பதன் மூலம் IBUS கருப்பொருள் மாற்ற.

source: If you make any changes to this content after applying this file in above extension,
ta: மேலே நீட்டிப்பில் இந்த கோப்பைப் பயன்படுத்திய பிறகு இந்த உள்ளடக்கத்தில் ஏதேனும் மாற்றங்களைச் செய்தால்,

source: for Customize IBus Extension before v68, please disable and then enable 'custom IME theme'
ta: V68 க்கு முன் IBUS நீட்டிப்பைத் தனிப்பயனாக்க, தயவுசெய்து முடக்கு, பின்னர் 'தனிப்பயன் IME கருப்பொருள்'

source: again to make the changes take effect.
ta: மீண்டும் மாற்றங்களைச் செய்ய.

source: Starting from v69, support stylesheets hot reload, CSS changes reflecting in real-time.
ta: V69 இலிருந்து தொடங்கி, ச்டைல்சீட்களை ஆதரிக்கவும், ஆட் ரீபீடோடை ஆதரிக்கவும், நிகழ்நேரத்தில் பிரதிபலிக்கும் சிஎச்எச் மாற்றங்கள்.

source: /* IBus style page button */
ta: / * IBUS பாணி பக்க பொத்தான் */

source: /* Fix system IBus theme background inherited in replaced theme */
ta: / * மாற்றியமைக்கப்பட்ட கருப்பொருளில் மரபுரிமையான கணினி IBUS கருப்பொருள் பின்னணி சரிசெய்யவும் */

source: /* Fix system IBus theme candidate window border inherited in replaced theme */
ta: / * கணினி IBUS கருப்பொருள் வேட்பாளர் சாளர எல்லை மாற்றப்பட்ட கருப்பொருளில் மரபுரிமையாக உள்ளது */

source: /* Fix system IBus theme candidate box shadow inherited in replaced theme */
ta: / * மாற்றியமைக்கப்பட்ட கருப்பொருளில் மரபுரிமை பெற்ற கணினி IBUS கருப்பொருள் வேட்பாளர் பெட்டி நிழல் */

source: /* Fix system IBus theme margin inherited in replaced theme */
ta: / * மாற்றியமைக்கப்பட்ட கருப்பொருளில் மரபுரிமையாக இருக்கும் கணினி IBUS கருப்பொருள் விளிம்பு */

source: /* Fix candidate color */
ta: / * வேட்பாளர் நிறத்தை சரிசெய்யவும் */

source: /* Fix black border at pointer when system theme is black */
ta: / * கணினி கருப்பொருள் கருப்பு நிறமாக இருக்கும்போது சுட்டிக்காட்டி கருப்பு எல்லையை சரிசெய்யவும் */

source: /* Unify system page button and IBus style page button */
ta: / * கணினி பக்க பொத்தான் மற்றும் IBUS பாணி பக்க பொத்தானை ஒன்றிணைக்கவும் */

source: Please select a GNOME theme to extract style sheet for IBus:
ta: IBUS க்கான பாணி தாளைப் பிரித்தெடுக்க ஒரு சினோம் கருப்பொருள் என்பதைத் தேர்ந்தெடுக்கவும்:

source: Please enter the path to store generated stylesheet:
ta: உருவாக்கப்பட்ட ச்டைல்சீட்டை சேமிப்பதற்கான பாதையை உள்ளிடவும்:

source: (Empty to be 'exportedIBusTheme.css' in current directory):
ta: (Empty பெறுநர் be 'exportedIBusTheme.css' in மின்னோட்ட்ம், ஓட்டம் directory):

source: Please select a CSS file:
ta: சிஎச்எச் கோப்பைத் தேர்ந்தெடுக்கவும்:

source: CSS file generated at:
ta: சிஎச்எச் கோப்பு உருவாக்கப்பட்டது:

source: Now you can use Customize IBus GNOME Shell Extension:
ta: இப்போது நீங்கள் தனிப்பயனாக்கு IBUS GNOME ஓடு நீட்டிப்பைப் பயன்படுத்தலாம்:

source: to change IBus theme by selecting the extracted stylesheet.
ta: பிரித்தெடுக்கப்பட்ட ச்டைல்சீட்டைத் தேர்ந்தெடுப்பதன் மூலம் IBUS கருப்பொருள் மாற்ற.

source: Done! Goodbye!
ta: முடிந்தது! குட்பை!

source: Please select a mode:
ta: ஒரு பயன்முறையைத் தேர்ந்தெடுக்கவும்:

source: Extract an IBus-related GTK theme
ta: IBUS தொடர்பான GTK கருப்பொருளைப் பிரித்தெடுக்கவும்

source: Extract an IBus-related GNOME theme stylesheet
ta: ஐபச் தொடர்பான சினோம் கருப்பொருள் ச்டைல்சீட்டைப் பிரித்தெடுக்கவும்

source: Note: You can only apply the stylesheet under GNOME.
ta: குறிப்பு: நீங்கள் க்னோமின் கீழ் ச்டைல்சீட்டை மட்டுமே பயன்படுத்த முடியும்.
